---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussCrossingReferences
source: html/09de51aa-f986-2646-13a5-0c8aaf361331.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussCrossingReferences Property

Truss top and bottom references cannot cross.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussCrossingReferences { get; }
```